app/views/favorites/_favorite.html.erb

        <span><i class="fas fa-heart"></i></span>
        <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]

      <span><i class="fas fa-heart"></i></span>
      <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]