app/views/books/_index.html.erb

SELECT "books".* FROM "books" WHERE (title LIKE('%ds%'))
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---

        <td><p>コメント数：<%= book.book_comments.count %></p></td>