app/views/books/_index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
        <%= link_to book_favorites_path(book), method: :delete do %>
        ♥<%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
          <%= link_to book_favorites_path(book), method: :post do %>
            ♡<%= book.favorites.count %> いいね

SELECT "books".* FROM "books" WHERE (title LIKE('%ds%'))
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---

        <td><p>コメント数：<%= book.book_comments.count %></p></td>