app/controllers/searchs_controller.rb

  def search
    @model = params[:model]
    search = params[:search]
    @keyword = params[:keyword]
    if @model == "1"
      @user = User.search(search,@keyword)
    else
      @book = Book.search(search,@keyword)
---
SELECT "users".* FROM "users" WHERE (name LIKE('%s%'))
SELECT "books".* FROM "books" WHERE (title LIKE('%ds%'))