app/controllers/users_controller.rb

  def index
    @user = current_user
    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "g"], ["profile_image_id", nil], ["updated_at", "2021-01-04 17:34:43.217783"], ["id", 2]]

  def ensure_correct_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]